Repository: rmraya/Fluenta
Catalog: i18n/fluenta_es.ditamap.tmx
Source language: en
Languages: es

source: Introduction
es: Introducción

source: Fluenta is a tool designed to simplify the translation of DITA projects. It can parse a DITA map, resolving the references to all topics and subtopics, preparing a unified XLIFF file that you can send to your Language Service Provider (LSP).
es: Fluenta es una herramienta diseñada para simplificar la traducción de proyectos DITA. Puede analizar un mapa DITA, resolviendo las referencias a todos los temas y subtemas, preparando un archivo XLIFF unificado que puede enviar a su Proveedor de Servicios Lingüísticos (PSL).

source: After updating your DITA content, you may want to update the translations of your project. All you have to do at this moment is:
es: Después de actualizar su contenido DITA, es posible que desee actualizar las traducciones de su proyecto. Todo lo que tienes que hacer en este momento es:

source: Yes
es: Si

source: String
es: Texto

source: Language code for the original DITA content
es: Código de idioma del contenido original del proyecto

source: String Array
es: Arreglo de Texto

source: An array containing the target languages for the project
es: Un arreglo que contiene los códigos de idiomas destino para el proyecto.

source: Number Array
es: Arreglo Numérico

source: An array containing the ids of existing memories to be associated with the project
es: Un arreglo que contiene los identificadores de las memorias existentes que se asociarán al proyecto

source: Generate a new XLIFF file.
es: Generar un nuevo archivo XLIFF

source: Licenses
es: Licencias

source: Fluenta uses components from these open source projects:
es: Fluenta utiliza componentes de estos proyectos de código abierto:

source: Formerly available from http://wutka.com/dtdparser.html
es: Antes disponible en http://wutka.com/dtdparser.html

source: Published under two licenses: Apache Style License and LGPL 2.1
es: Publicado bajo dos licencias: Licencia de Estilo Apache y LGPL 2.1

source: Available from https://github.com/stleary/JSON-java
es: Disponible en https://github.com/stleary/JSON-java

source: Published under a custom license
es: Publicado bajo una licencia personalizada

source: Available from https://jsoup.org
es: Disponible en https://jsoup.org

source: Published under MIT License
es: Publicado bajo la Licencia MIT

source: Available from https://h2database.com/
es: Disponible en https://h2database.com/

source: Published under two licenses: Mozilla Public License 2.0 and Eclipse Public License 1.0
es: Publicado bajo dos licencias: Licencia Pública Mozilla 2.0 y Licencia Pública Eclipse 1.0

source: Send the new XLIFF file to your Language Service Provider and wait for a translated XLIFF.
es: Envíe el nuevo archivo XLIFF a su Proveedor de Servicios Lingüísticos y espere un XLIFF traducido.

source: Available from https://mapdb.org
es: Disponible en https://mapdb.org

source: Published under Apache License
es: Publicado bajo la Licencia Apache

source: Available from https://www.maxprograms.com/products/openxliff.html
es: Disponible en https://www.maxprograms.com/products/openxliff.html

source: Published under Eclipse Public License 1.0
es: Publicado bajo la Licencia Pública Eclipse 1.0

source: Available from https://www.maxprograms.com/products/swordfish.html
es: Disponible en https://www.maxprograms.com/products/swordfish.html

source: Available from https://www.eclipse.org/swt/
es: Disponible en https://www.eclipse.org/swt/

source: Published under Eclipse Public License 2.0
es: Publicado bajo la Licencia Pública Eclipse 2.0

source: Import the translated XLIFF and select the folder where to store the updated translated version of your map and topics.
es: Importe el archivo XLIFF traducido y seleccione una carpeta donde almacenar la versión traducida actualizada de su mapa y contenidos.

source: Export TMX File
es: Exportar Archivo TMX

source: Use the following parameters to export a memory as a TMX file from command line:
es: Utilice los siguientes parámetros para exportar una memoria como archivo TMX desde la línea de comandos:

source: Parameter
es: Parámetro

source: Value
es: Valor

source: Description
es: Descripción

source: Required
es: Requerido

source: memId
es: idMemoria

source: The id of the memory to be exported
es: El identificador de la memoria a exportar

source: tmxFile
es: archivoTmx

source: Fluenta automatically recovers In-Context Exact (ICE) matches from the translation that was stored in the previous cycle. This means that you don't need to pay again for the translation of content that didn't change.
es: Fluenta recupera automáticamente las coincidencias "In-Context Exact" (ICE) de la traducción que se almacenó en el ciclo anterior. Esto significa que no tendrá que volver a pagar por la traducción de contenidos que no hayan cambiado.

source: Path to the TMX file to be generated
es: Ruta al archivo TMX a generar

source: Example:
es: Ejemplo:

source: Generate XLIFF Files
es: Generar Archivos XLIFF

source: Use the following parameters to generate XLIFF files for a project from command line:
es: Utilice los siguientes parámetros para generar archivos XLIFF desde la línea de comandos:

source: JSON file
es: Archivo JSON

source: Thanks to the Translation Memory technology included in Fluenta, you can also recover translations of parts that were slightly changed.
es: Gracias a la tecnología de Memoria de Traducción incluida en Fluenta, también puede recuperar traducciones de partes ligeramente modificadas.

source: Full path to a JSON file containing the data required for generating XLIFF files.
es: Ruta completa a un archivo JSON que contiene los datos necesarios para generar los archivos XLIFF.

source: Selects whether progress information is logged or not in stdout.
es: Selecciona si la información de progreso se muestra o no en la consola.

source: Where the content of genXLIFF.json should be like:
es: Donde el contenido de genXLIFF.json debe ser similar a:

source: JSON Value Pairs
es: Pares de Valores JSON

source: Member
es: Clave

source: Data Type
es: Tipo de Dato

source: Advanced Configuration
es: Configuración Avanzada

source: Number
es: Número

source: Project identifier
es: Identificador de proyecto

source: Path to the folder where XLIFF files and optional word counts should be stored
es: Ruta a la carpeta donde deben guardarse los archivos XLIFF y estadísticas opcionales

source: An array containing the target languages for the XLIFF files
es: Un arreglo que contiene los códigos de idiomas destino para los archivos XLIFF

source: Fluenta default settings can be changed in the Preferences dialog.
es: La configuración predeterminada de Fluenta puede modificarse en el cuadro de diálogo Preferencias .

source: Path to a .ditaval file for filtering content to be extracted
es: Ruta a un archivo .ditaval para filtrar el contenido a extraer

source: Boolean
es: Booleano

source: Selects wheteher existing ICE matches should be reused. Default false
es: Selecciona si las coincidencias ICE existentes deben reutilizarse. Valor predeterminado: false .

source: Selects wether topics that have not changed since the last translation cycle should be included in the generated XLIFF files. Default value: false
es: Selecciona si los archivos que no han cambiado desde el último ciclo de traducción deben incluirse en los documentos XLIFF generados. Valor predeterminado: false

source: To open the Preferences dialog on Windows or Linux, in main menu select Settings Preferences .
es: Para abrir el cuadro de diálogo Preferencias en Windows o Linux, en el menú principal seleccione Configuración Preferencias .

source: Selects whether translation memories should be used. Default value: false
es: Selecciona si debe usarse memorias de traducción. Valor predeterminado: false

source: Selects whether word counts should be generated. Default value: false
es: Selecciona si debe generarse estadísticas. Valor predeterminado: false

source: Selects whether XLIFF 2.0 will be generated instead of XLIFF 1.2. Default value: false
es: Selecciona si se generará XLIFF 2.0 en lugar de XLIFF 1.2. Valor predeterminado: false

source: Selects wether paragraph segmentation should be used instead of sentence segmentation. Default value: false
es: Selecciona si se debe utilizar segmentación por párrafos en lugar de segmentación por oraciones. Valor predeterminado: false

source: To open the Preferences dialog on macOS, select Apple Preferences in the menu.
es: Para abrir el cuadro de diálogo Preferencias en maOS, seleccione Apple Preferencias en el menú.

source: Selects wether tracked changes from Oxygen XML Editor should be ignored. Default value: false
es: Selecciona si se deben ignorar las revisiones de Oxygen XML Editor. Valor predeterminado: false

source: Selects whether skeletons should be embedded in the generated XLIFF files, allowing conversion back to DITA in any computer using OpenXLIFF Filters or XLIFF Manager . Default value: false
es: Selecciona si los esqueletos deben incrustarse en los archivos XLIFF generados, permitiendo la conversión de nuevo a DITA en cualquier ordenador que utilice OpenXLIFF Filters o XLIFF Manager . Valor predeterminado: false

source: Import TMX File
es: Importar archivo TMX

source: Use the following parameters to import a TMX file into a memory from command line:
es: Utilice los siguientes parámetros para importar un archivo TMX a una memoria desde la línea de comandos:

source: Fluenta implements the procedure for translating DITA projects recommended by the OASIS DITA Adoption TC .
es: Fluenta aplica el procedimiento de traducción de proyectos DITA recomendado por el OASIS DITA Adoption TC .

source: Command Line Interface
es: Interfaz de Línea de Comandos

source: The id of the memory.
es: Identificador de la memoria

source: Path to the TMX file to be imported
es: Ruta al archivo TMX a importar

source: Selects whether progress information is logged or not in stdout
es: Selecciona si la información de progreso se muestra o no en la consola

source: Fluenta can be integrated into publishing and editing workflows using its Command Line Interface (CLI).
es: Fluenta puede integrarse en los flujos de trabajo de publicación y edición mediante su Interfaz de Línea de Comandos (CLI).

source: Import XLIFF File
es: Importar Archivo XLIFF

source: Use the following parameters to import a translated XLIFF file into a project from command line:
es: Utilice los siguientes parámetros para importar desde la línea de comandos archivos XLIFF traducidos en un proyecto :

source: Full path to a JSON file containing the data required for importing the XLIFF file
es: Ruta completa a un archivo JSON que contiene los datos necesarios para importar el archivo XLIFF

source: The methods exposed by Fluenta's CLI are:
es: Los métodos expuestos por la CLI de Fluenta son:

source: Where the content of impXLIFF.json should be like:
es: Donde el contenido de impXLIFF.json debe ser similar a:

source: Create a project ;
es: Crear un proyecto ;

source: Path to the XLIFF file to be imported
es: Ruta al archivo XLIFF a importar

source: Path to the folder where the translated DITA files should be stored
es: Ruta a la carpeta donde deben guardarse los archivos DITA traducidos

source: Remove project ;
es: Eliminar Proyecto ;

source: Selects whether the memory associated with the project should be updated with the translations in the XLIFF file
es: Selecciona si la memoria asociada al proyecto debe actualizarse con las traducciones del archivo XLIFF

source: Selects whether segments that are translated but not approved should be treated as approved. Default value: false
es: Selecciona si los segmentos traducidos pero no aprobados deben tratarse como aprobados. Valor predeterminado: false

source: Selects whether inline tag errors should be ignored. If set to false and errors are found, a detailed report in HTML format is generated and stored in the folder that contains the XLIFF file. Default value: false
es: Selecciona si los errores de etiquetas deben ignorarse. Si se establece en false y se encuentran errores, se genera un informe detallado en formato HTML que se almacena en la carpeta que contiene el archivo XLIFF. Valor predeterminado: false

source: Subscription Management
es: Manejo de Subscripciones

source: Use the following parameters to register a Subscription Key from command line:
es: Utilice los siguientes parámetros para registrar una clave de suscripción desde la línea de comandos:

source: Retrieve the list of projects ;
es: Obtener la lista de proyectos ;

source: key
es: clave

source: The Subscription Key to be registered
es: La clave de suscripción a registrar

source: Registering a Subscription Key requires an Internet connection.
es: El registro de una clave de suscripción requiere una conexión a Internet.

source: General Options
es: Opciones Generales

source: Generate XLIFF files and optional word counts ;
es: Generar archivos XLIFF y estadísticas opcionales ;

source: The following picture shows the General tab of the Preferences dialog:
es: La siguiente imagen muestra la pestaña General del cuadro de diálogo Preferencias :

source: Project related options
es: Opciones relacionadas con proyectos

source: Use the Application Language drop-down to select the language to use in the Graphical User Interface ((GUI).
es: Utilice la lista desplegable Idioma de la Aplicación para seleccionar el idioma que se utilizará en la interfaz gráfica de usuario (GUI).

source: If you want to change storage locations for your projects or memories, enter the desired paths on the Projects Folder and Memories Folder text boxes or click the associated Browse... buttons to select folders from the file system.
es: Si desea cambiar las ubicaciones de almacenamiento de sus proyectos o memorias, introduzca las rutas deseadas en los cuadros de texto Carpeta de Proyectos y Carpeta de Memorias o haga clic en los botones Examinar... asociados para seleccionar carpetas del sistema de archivos.

source: Avoid using folders that could be modified by other programs while you work.
es: Evite usar carpetas que puedan ser modificadas por otros programas mientras trabaja.

source: To change the default SRX (Segmentation Rules eXchange) file that Fluenta uses for segmenting XLIFF files:
es: Para cambiar el archivo SRX (Segmentation Rules eXchange) predeterminado que Fluenta utiliza para segmentar archivos XLIFF:

source: Type the name of the SRX file in the Default SRX File text box or use the Browse... button to select an SRX file from the file system.
es: Escriba el nombre del archivo SRX en el cuadro de texto Archivo SRX Predeterminado o utilice el botón Examinar... para seleccionar un archivo SRX del sistema de archivos.

source: To add new target languages to the default set:
es: Para añadir nuevos idiomas al conjunto predeterminado:

source: click the Add Target Language button and the following dialog will appear:
es: Haga clic en el botón Añadir Idioma Destino y aparecerá el siguiente cuadro de diálogo:

source: Add Language dialog
es: Cuadro de diálogo Añadir Idioma

source: Import an XLIFF file ;
es: Importar un archivo XLIFF ;

source: Select a language from the Language drop-down list.
es: Seleccione un idioma de la lista desplegable Idioma .

source: Click the Add Language button.
es: Haga clic en el botón Añadir Idioma .

source: To remove unnecessary languages from the default set:
es: Para eliminar idiomas innecesarios del conjunto predeterminado:

source: Select the check boxes next to each language you want to remove.
es: Seleccione las casillas de verificación situadas junto a cada idioma que desee eliminar.

source: Click the Remove Selected Languages button.
es: Haga clic en el botón Eliminar Idiomas Seleccionados .

source: Click the Save Preferences button after making any change to the default settings.
es: Haga clic en el botón Guardar Preferencias después de hacer cambios en la configuración predeterminada.

source: Remove Project
es: Eliminar Proyecto

source: Use the following parameters to remove a project from command line:
es: Utilice los siguientes parámetros para eliminar un proyecto desde la línea de comandos:

source: Create a memory ;
es: Crear una memoria ;

source: Retrieve Memory List
es: Obtener Lista de Memorias

source: Use the following parameter to retrieve the list of memories from command line:
es: Utilice los siguientes parámetros para obtener la lista de memorias desde la línea de comandos:

source: Retrieve the list of memories ;
es: Obtener la lista de memorias ;

source: Output example:
es: Ejemplo de salida:

source: Retrieve Project List
es: Obtener Lista de Proyectos

source: Use the following parameter to retrieve the list of projects from command line:
es: Utilice los siguientes parámetros para obtener la lista de proyectos desde la línea de comandos:

source: How it works
es: Cómo Funciona

source: Import a TMX file into a memory ;
es: Importar un archivo TMX en una memoria ;

source: Subscriptions
es: Suscripciones

source: Fluenta is available in two modes:
es: Fluenta está disponible en dos modos:

source: Source Code
es: Código Fuente

source: Yearly Subscriptions for installers and support
es: Suscripciones Anuales para instaladores y soporte técnico

source: Source code of Fluenta is free. Anyone can download the source code from Github.com , compile, modify and use it at no cost in compliance with the accompanying license terms.
es: El código fuente de Fluenta es libre. Cualquiera puede descargar el código fuente de Github.com , compilarlo, modificarlo y utilizarlo sin costo alguno respetando los términos de la licencia adjunta.

source: Export a memory as TMX file ;
es: Exportar una memoria a un archivo TMX ;

source: The version of Fluenta included in the official installers from Maxprograms Download Page can be used at no cost for 30 days requesting a free Evaluation Key.
es: La versión de Fluenta incluida en los instaladores oficiales de la página de descargas de Maxprograms puede utilizarse sin costo durante 30 días solicitando un código de evaluación gratuito.

source: Subscription Keys are available at Maxprograms Online Store . Subscription Keys cannot be shared or transferred to different machines.
es: Las Claves de Suscripción están disponibles en la tienda en línea de Maxprograms . Las Claves de Suscripción no se pueden compartir ni transferir a diferentes ordenadores.

source: Subscription version includes unlimited direct email support at tech@maxprograms.com
es: La versión de suscripción incluye asistencia directa ilimitada por correo electrónico en tech@maxprograms.com

source: Differences Summary
es: Resumen de Diferencias

source: Subscription Based
es: Por Suscripción

source: Ready To Use Installers
es: Instaladores listos para usar

source: Register a Subscription Key ;
es: Registrar una clave de suscripción ;

source: Notarized macOS launcher
es: Ejecutable de macOS notariado

source: Signed launcher and installer for Windows
es: Ejecutable e instalador para Windows firmado digitalmente

source: Restricted Features
es: Características Restringidas

source: None
es: Ninguna

source: Technical Support
es: Soporte Técnico

source: Retrieve version information .
es: Obtener información de versión .

source: Peer support at Groups.io
es: Apoyo de otros usuarios en Groups.io

source: Direct email at tech@maxprograms.com
es: Correo electrónico directo a tech@maxprograms.com

source: Translating DITA Projects
es: Traducir Proyectos DITA

source: Translating DITA projects is a process that comprises these steps:
es: Traducir proyectos DITA es un proceso que comprende estos pasos:

source: Create a project
es: Crear un proyecto

source: Generate XLIFF files
es: Generar archivos XLIFF

source: Translate XLIFF files
es: Traducir archivos XLIFF

source: Import translated XLIFF files
es: Importar archivos XLIFF traducidos

source: Translation Memories
es: Memorias de Traducción

source: On macOS and Linux use fluenta_cli.sh for executing Fluenta without the graphical user interface.
es: En macOS y Linux utilice fluenta_cli.sh para ejecutar Fluenta sin su interfaz gráfica.

source: Translation Memory (TM) is a language technology that enables the translation of segments (paragraphs, sentences or phrases) of documents by searching for similar segments in a database and suggesting matches that are found in the databases as possible translations.
es: La Memoria de Traducción (MT) es una tecnología lingüística que permite traducir segmentos (párrafos, frases u oraciones) de documentos mediante la búsqueda de segmentos similares en una base de datos y la sugerencia de coincidencias encontradas en las bases de datos como posibles traducciones.

source: When you create a project, a new translation memory is automatically created and associated with your project. When you import a translated XLIFF file, the memory associated with the project is populated with the translations included in the XLIFF file.
es: Al crear un proyecto, se crea automáticamente una nueva memoria de traducción asociada al proyecto. Al importar un archivo XLIFF traducido, la memoria asociada al proyecto se rellena con las traducciones incluidas en el archivo XLIFF.

source: When you generate a new XLIFF file after adding new content to your project, Fluenta can reuse the data stored in the associated memories to translate the newly added content, reducing translation costs.
es: Cuando se genera un nuevo archivo XLIFF tras añadir nuevos contenidos al proyecto, Fluenta puede reutilizar los datos almacenados en las memorias asociadas para traducir los contenidos recién añadidos, reduciendo así los costes de traducción.

source: Retrieve Version Information
es: Obtener Información de Versión

source: Use the following parameter to retrieve Fluenta version and build information from command line:
es: Utilice el siguiente parámetro para recuperar la versión de Fluenta y la información de compilación desde la línea de comandos:

source: On macOS the default location for the script is /Applications/Fluenta.app/Contents/Resources/fluenta_cli.sh
es: En macOS la ubicación predeterminada del script es /Applications/Fluenta.app/Contents/Resources/fluenta_cli.sh

source: XML Catalog
es: Catálogo XML

source: The application includes a default XML catalog with DTDs and XML Schemas for the most relevant formats and supported document types. Additional DTDs and XML Schemas can be added by the user as needed.
es: La aplicación incluye un catálogo XML predeterminado con DTD y esquemas XML para los formatos más relevantes y los tipos de documentos compatibles. El usuario puede añadir DTD y esquemas XML adicionales según sus necesidades.

source: Select the XML Options tab in the Preferences dialog to add or remove entries from the catalog.
es: Seleccione la pestaña Opciones XML en el cuadro de diálogo Preferencias para añadir o eliminar entradas del catálogo.

source: Add Catalog Entry
es: Añadir Entrada de Catálogo

source: Click the Add Catalog Entry button and a file selection dialog will appear. Locate the catalog in the file system and select it.
es: Haga clic en el botón Añadir Entrada de Catálogo y aparecerá un cuadro de diálogo de selección de archivos. Localice el catálogo en el sistema de archivos y selecciónelo.

source: Remove Catalog Entry
es: Eliminar Entrada de Catálogo

source: Select the catalog entry to remove in the catalogs table. Click the Remove Catalog Entry button and the application's catalog will be updated to reflect the change.
es: Seleccione la entrada de catálogo que desea eliminar en la tabla de catálogos. Pulse el botón Eliminar Entrada de Catálogo y el catálogo de la aplicación se actualizará para reflejar el cambio.

source: XML Options
es: Opciones de XML
